app/views/bookings/_form.html.erb

SELECT "hotels".* FROM "hotels"
---
    <%= f.label :"Please confirm the Hotel" %><br />
	<%= f.collection_select :room_id, Hotel.all, :id, :name %>

SELECT "rooms".* FROM "rooms"
---
    <%= f.label :category %><br />
	<%= f.collection_select :room_id, Room.all, :id, :category %>