app/views/payments/_form.html.erb

    <%= f.label :booking_id %><br />
	<%= f.collection_select :booking_id , Booking.all, :id, :checkin %>
---
SELECT "bookings".* FROM "bookings"

    <%= f.label :"Email"%><br />
	<%= f.collection_select :user_id , User.all, :id, :email %>
---
SELECT "users".* FROM "users"