app/views/rooms/_form.html.erb

    <%= f.label :hotel_id %><br />
	<%= f.collection_select :hotel_id, Hotel.all, :id, :name %>
---
SELECT "hotels".* FROM "hotels"