app/controllers/hotels_controller.rb

SELECT "hotels".* FROM "hotels"
---
  def index
    @hotels = Hotel.all

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @hotel = Hotel.find(params[:id])

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @hotel = Hotel.find(params[:id])

INSERT INTO "hotels" ("address", "contactInfo", "created_at", "image", "latitude", "location", "longitude", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @hotel = Hotel.new(params[:hotel])

    respond_to do |format|
      if @hotel.save

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "hotels" SET "image" = 'maldron hotel', "updated_at" = '2015-02-01 19:52:07.753980' WHERE "hotels"."id" = 1
---
  def update
    @hotel = Hotel.find(params[:id])

    respond_to do |format|
      if @hotel.update_attributes(params[:hotel])

SELECT "hotels".* FROM "hotels" WHERE "hotels"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "hotels" WHERE "hotels"."id" = ?  [["id", 1]]
---
  def destroy
    @hotel = Hotel.find(params[:id])
    @hotel.destroy