app/controllers/payments_controller.rb

SELECT "payments".* FROM "payments"
---
  def index
    @payments = Payment.all

SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT 1  [["id", "user"]]
---
  def show
    @payment = Payment.find(params[:id])

INSERT INTO "payments" ("booking_id", "created_at", "deposit", "pamentMethod", "totalCost", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @payment = Payment.new(params[:payment])

    respond_to do |format|
      if @payment.save

SELECT "payments".* FROM "payments" WHERE "payments"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "payments" WHERE "payments"."id" = ?  [["id", 5]]
---
  def destroy
    @payment = Payment.find(params[:id])
    @payment.destroy