app/controllers/rooms_controller.rb

  def index
    @rooms = Room.all
---
SELECT "rooms".* FROM "rooms"

  def show
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @room = Room.find(params[:id])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @room = Room.new(params[:room])

    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("category", "created_at", "extras", "hotel_id", "price", "roomImage", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @room = Room.find(params[:id])

    respond_to do |format|
      if @room.update_attributes(params[:room])
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "rooms" SET "roomImage" = 'Standard-Room.jpg', "updated_at" = '2015-02-16 11:40:24.057197' WHERE "rooms"."id" = 6

  def search
	@rooms = Room.search params[:q]
---
SELECT "rooms".* FROM "rooms" WHERE (category LIKE 'suite%')

  def destroy
    @room = Room.find(params[:id])
    @room.destroy
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 2]]