app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = 'bruce' LIMIT 1
---
  def create
   user = User.find_by_name(params[:name])

SELECT "admins".* FROM "admins" WHERE "admins"."name" = 'mark' LIMIT 1
---
	def createa
		a = Admin.find_by_name(params[:name])